Repository: joao-victor-costa-gomes/ReduzLab
Catalog: app/translations/*/LC_MESSAGES/messages.po
Languages: pt

source: No file part in request. Please try again.
pt: Nenhuma parte de arquivo na requisição. Por favor, tente novamente.

source: No file selected. Please choose a file to upload.
pt: Nenhum arquivo selecionado. Por favor, escolha um arquivo para enviar.

source: File "%(filename)s" uploaded successfully!
pt: Arquivo "%(filename)s" enviado com sucesso!

source: Data preview generated successfully!
pt: Pré-visualização dos dados gerada com sucesso!

source: Invalid file type. Please upload a .csv or .xlsx file.
pt: Tipo de arquivo inválido. Por favor, envie um arquivo .csv ou .xlsx.

source: Could not delete all files. %(deleted)s files deleted, %(failed)s failed.
pt: Não foi possível deletar todos os arquivos. %(deleted)s arquivos deletados, %(failed)s falharam.

source: Successfully deleted %(count)s files from memory.
pt: %(count)s arquivos deletados da memória com sucesso.

source: File is too large. The maximum allowed size is %(size)s MB.
pt: O arquivo é muito grande. O tamanho máximo permitido é de %(size)s MB.

source: Execution Time (s)
pt: Tempo de Execução (s)

source: An error occurred during processing: %(error)s
pt: Ocorreu um erro durante o processamento: %(error)s

source: LDA is a supervised algorithm for classification. The target column '%(target_col)s' has too many unique values and seems to be continuous. Please choose a categorical target.
pt: O LDA é um algoritmo supervisionado para classificação. A coluna alvo '%(target_col)s' possui valores únicos demais e parece ser contínua. Por favor, escolha um alvo categórico.

source: NCA is a supervised algorithm for classification. The target column '%(target_col)s' has too many unique values and seems to be continuous. Please choose a categorical target.
pt: O NCA é um algoritmo supervisionado para classificação. A coluna alvo '%(target_col)s' possui valores únicos demais e parece ser contínua. Por favor, escolha um alvo categórico.

source: Explained Variance (%%)
pt: Variância Explicada (%%)

source: Algorithm Parameters
pt: Parâmetros do Algoritmo

source: Sample Rate (%%):
pt: Taxa de Amostragem (%%):

source: Target Column:
pt: Coluna Alvo:

source: Select a column
pt: Selecione uma coluna

source: Output Dimension:
pt: Dimensão de Saída:

source: Scaler:
pt: Escalonador:

source: None
pt: Nenhum

source: Graph Parameters
pt: Parâmetros do Gráfico

source: Graph File Type:
pt: Tipo de Arquivo do Gráfico:

source: PNG (static image)
pt: PNG (imagem estática)

source: HTML (interactive plot)
pt: HTML (gráfico interativo)

source: Graph Title (optional):
pt: Título do Gráfico (opcional):

source: e.g., PCA of Iris Dataset
pt: ex.: PCA do Dataset Iris

source: X-Axis Range:
pt: Intervalo do Eixo X:

source: Min
pt: Mín

source: to
pt: até

source: Max
pt: Máx

source: Y-Axis Range:
pt: Intervalo do Eixo Y:

source: Leave blank for auto-ranging.
pt: Deixe em branco para ajuste automático.

source: Results
pt: Resultados

source: Metrics
pt: Métricas

source: Plot
pt: Gráfico

source: %(name)s Plot
pt: Gráfico %(name)s

source: Download Plot
pt: Baixar Gráfico

source: Download Reduced Data (CSV)
pt: Baixar Dados Reduzidos (CSV)

source: Switch Algorithm
pt: Trocar Algoritmo

source: Quickly switch to another algorithm using the same uploaded dataset.
pt: Troque rapidamente para outro algoritmo usando o mesmo dataset enviado.

source: %(name)s Algorithm
pt: Algoritmo %(name)s

source: Data Preview & Validation Report
pt: Pré-visualização e Relatório de Validação dos Dados

source: Validation Report
pt: Relatório de Validação

source: Please review the following issues before proceeding. Algorithms may fail with non-numeric or missing data.
pt: Por favor, revise os problemas a seguir antes de prosseguir. Os algoritmos podem falhar com dados não-numéricos ou ausentes.

source: Non-Numeric Columns Found:
pt: Colunas Não-Numéricas Encontradas:

source: Columns with Missing Values:
pt: Colunas com Valores Ausentes:

source: missing
pt: ausente(s)

source: Could not load data preview. Please
pt: Não foi possível carregar a pré-visualização dos dados. Por favor

source: upload a file
pt: envie um arquivo

source: first.
pt: primeiro.

source: ReduzLab - Dimensionality Reduction
pt: ReduzLab - Redução de Dimensionalidade

source: History
pt: Histórico

source: ReduzLab Project
pt: Projeto ReduzLab

source: Developed by:
pt: Desenvolvido por:

source: Check the project repository at this
pt: Confira o repositório do projeto neste

source: File History
pt: Histórico de Arquivos

source: Uploaded Datasets
pt: Datasets Enviados

source: Download
pt: Baixar

source: No uploaded files found.
pt: Nenhum arquivo enviado encontrado.

source: Generated Plots
pt: Gráficos Gerados

source: View
pt: Visualizar

source: No plots found.
pt: Nenhum gráfico encontrado.

source: Reduced Data (CSV)
pt: Dados Reduzidos (CSV)

source: No reduced data files found.
pt: Nenhum arquivo de dados reduzidos encontrado.

source: Delete All Files from Memory
pt: Deletar Todos os Arquivos da Memória

source: Confirm Deletion
pt: Confirmar Exclusão

source: Are you sure you want to delete all uploaded and generated files?
pt: Você tem certeza que deseja deletar todos os arquivos enviados e gerados?

source: This action cannot be undone.
pt: Esta ação não pode ser desfeita.

source: Cancel
pt: Cancelar

source: Yes, Delete All Files
pt: Sim, Deletar Todos os Arquivos

source: 1. Upload your Dataset
pt: 1. Envie seu Dataset

source: Select a CSV or XLSX file from your computer to get started.
pt: Selecione um arquivo CSV ou XLSX do seu computador para começar.

source: Dataset File:
pt: Arquivo do Dataset:

source: Upload File
pt: Enviar Arquivo

source: 2. Data Preview & Validation
pt: 2. Pré-visualização e Validação dos Dados

source: 3. Select a Reduction Algorithm
pt: 3. Selecione um Algoritmo de Redução

source: Choose an algorithm below to proceed with the dimensionality reduction.
pt: Escolha um algoritmo abaixo para prosseguir com a redução de dimensionalidade.

source: Configure Isomap Parameters
pt: Configurar Parâmetros do Isomap

source: Advanced Parameters
pt: Parâmetros Avançados

source: Advanced Isomap Parameters
pt: Parâmetros Avançados do Isomap

source: Number of Neighbors:
pt: Número de Vizinhos:

source: Distance Metric:
pt: Métrica de Distância:

source: Eigen Solver:
pt: Solver de Autovetores:

source: Path Method:
pt: Método de Caminho:

source: Neighbors Algorithm:
pt: Algoritmo de Vizinhos:

source: Parallel Jobs (n_jobs, optional):
pt: Processos Paralelos (n_jobs, opcional):

source: e.g., -1 for all cores
pt: ex.: -1 para todos os núcleos

source: Run Isomap
pt: Executar Isomap

source: Configure KPCA Parameters
pt: Configurar Parâmetros do KPCA

source: Advanced KPCA Parameters
pt: Parâmetros Avançados do KPCA

source: Degree (for Poly kernel):
pt: Grau (para o kernel Poly):

source: Gamma (for RBF, Poly, Sigmoid):
pt: Gama (para RBF, Poly, Sigmoid):

source: Default: 1/n_features
pt: Padrão: 1/n_features

source: Coef0 (for Poly, Sigmoid):
pt: Coef0 (para Poly, Sigmoid):

source: Random State (optional):
pt: Estado Aleatório (opcional):

source: For arpack/randomized solvers
pt: Para solvers arpack/randomized

source: Run KPCA
pt: Executar KPCA

source: Configure LDA Parameters
pt: Configurar Parâmetros do LDA

source: Advanced LDA Parameters
pt: Parâmetros Avançados do LDA

source: None, auto, or a float 0-1
pt: Nenhum, 'auto', ou um float 0-1

source: Only for 'lsqr' and 'eigen' solvers.
pt: Apenas para os solvers 'lsqr' e 'eigen'.

source: Run LDA
pt: Executar LDA

source: Configure LLE Parameters
pt: Configurar Parâmetros do LLE

source: Advanced LLE Parameters
pt: Parâmetros Avançados do LLE

source: Regularization (reg):
pt: Regularização (reg):

source: Method:
pt: Método:

source: e.g., 42
pt: ex.: 42

source: Run LLE
pt: Executar LLE

source: Configure NCA Parameters
pt: Configurar Parâmetros do NCA

source: Advanced NCA Parameters
pt: Parâmetros Avançados do NCA

source: Initialization Method:
pt: Método de Inicialização:

source: Max Iterations:
pt: Máximo de Iterações:

source: Tolerance (optional):
pt: Tolerância (opcional):

source: Run NCA
pt: Executar NCA

source: Configure PCA Parameters
pt: Configurar Parâmetros do PCA

source: Advanced PCA Parameters
pt: Parâmetros Avançados do PCA

source: Enable Whitening
pt: Habilitar Whitening

source: Random State (for reproducibility):
pt: Estado Aleatório (para reprodutibilidade):

source: Run PCA
pt: Executar PCA

source: Configure T-SNE Parameters
pt: Configurar Parâmetros do T-SNE

source: Advanced T-SNE Parameters
pt: Parâmetros Avançados do T-SNE

source: Perplexity:
pt: Perplexidade:

source: Learning Rate:
pt: Taxa de Aprendizado:

source: e.g., 200.0 or 'auto'
pt: ex.: 200.0 ou 'auto'

source: Early Exaggeration:
pt: Exagero Inicial:

source: Barnes-Hut (Fast)
pt: Barnes-Hut (Rápido)

source: Exact (Slow)
pt: Exato (Lento)

source: Run T-SNE
pt: Executar T-SNE

source: Page Not Found
pt: Página Não Encontrada

source: Sorry, we couldn't find the page you were looking for.
pt: Desculpe, não conseguimos encontrar a página que você estava procurando.

source: Back to Home
pt: Voltar para a Página Inicial

source: An Unexpected Error Occurred
pt: Ocorreu um Erro Inesperado

source: We're sorry, something went wrong on our end. Contact the administrators.
pt: Lamentamos, algo deu errado do nosso lado. Contate os administradores.

source: Error reading or processing file: %(error)s
pt: Erro ao ler ou processar o arquivo: %(error)s

source: Please upload a dataset first to continue.
pt: Por favor, envie um dataset primeiro para continuar.

source: The uploaded file could not be found. Please upload it again.
pt: O arquivo enviado não foi encontrado. Por favor, envie-o novamente.

source: An error occurred while reading your file: %(error)s
pt: Ocorreu um erro ao ler o seu arquivo: %(error)s

source: Sample Rate must be between 1 and 100.
pt: A Taxa de Amostragem deve ser entre 1 e 100.

source: Sample Rate must be a valid number.
pt: A Taxa de Amostragem deve ser um número válido.

source: You must select a Target Column.
pt: Você deve selecionar uma Coluna Alvo.

source: Error: Column "%(column)s" not found in the dataset.
pt: Erro: A coluna "%(column)s" não foi encontrada no dataset.

source: Dimension must be 2D or 3D.
pt: A dimensão deve ser 2D ou 3D.

source: Dimension must be a valid number (2 or 3).
pt: A dimensão deve ser um número válido (2 ou 3).

source: Invalid scaler selected.
pt: Escalonador inválido selecionado.

source: Invalid plot type selected.
pt: Tipo de gráfico inválido selecionado.

source: Axis range value for "%(param)s" must be a valid number.
pt: O valor do intervalo do eixo para "%(param)s" deve ser um número válido.

source: Number of Neighbors must be a positive number.
pt: O Número de Vizinhos deve ser um número positivo.

source: Invalid Metric selected.
pt: Métrica inválida selecionada.

source: Invalid Eigen Solver selected.
pt: Solver de Autovetores inválido selecionado.

source: Invalid Path Method selected.
pt: Método de Caminho inválido selecionado.

source: Invalid Neighbors Algorithm selected.
pt: Algoritmo de Vizinhos inválido selecionado.

source: Invalid value in advanced parameters: %(error)s
pt: Valor inválido nos parâmetros avançados: %(error)s

source: Invalid Kernel selected.
pt: Kernel inválido selecionado.

source: Shrinkage cannot be used with the 'svd' solver.
pt: Shrinkage não pode ser usado com o solver 'svd'.

source: Shrinkage value must be between 0 and 1.
pt: O valor de Shrinkage deve ser entre 0 e 1.

source: Shrinkage must be 'auto' or a valid number.
pt: Shrinkage deve ser 'auto' ou um número válido.

source: Invalid Method selected.
pt: Método inválido selecionado.

source: Invalid Initialization Method selected.
pt: Método de Inicialização inválido selecionado.

source: Max Iterations must be a positive number.
pt: O Máximo de Iterações deve ser um número positivo.

source: Tolerance cannot be negative.
pt: A Tolerância não pode ser negativa.

source: Invalid SVD solver selected.
pt: SVD solver inválido selecionado.

source: Random State must be a valid integer.
pt: O Estado Aleatório deve ser um número inteiro válido.

source: Perplexity must be between 1 and the number of samples (%(count)s).
pt: A Perplexidade deve ser entre 1 e o número de amostras (%(count)s).

source: Max Iterations must be at least 250.
pt: O Máximo de Iterações deve ser no mínimo 250.

source: Invalid Init Method.
pt: Método de Inicialização inválido.

source: Invalid Method.
pt: Método inválido.

source: Invalid Metric.
pt: Métrica inválida.
